# Напишите программу, в которой
# пользователь будет задавать две строки, а программа
# - определять количество вхождений одной строки в
# другую.

line = input('input line:')
query = input('input query: ')
print(line.count(query))

print(input().count(input()))