"""
Напишите программу, которая на вход принимает число и выдаёт его квадрат (число умноженное на само себя).
"""

print(int(input())**2)

print(int(float(input())))

print([int(el) for el in range(abs(round(float(input())))+1)])